Revit 2024 API
FabricationConfiguration.GetPartCustomDataType Method
 Gets the custom data type from its identifier. See FabricationCustomDataType enumerator.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2017 Subscription Update
Syntax
C#
public FabricationCustomDataType GetPartCustomDataType(
	int customDataId
)
Visual Basic
Public Function GetPartCustomDataType ( _
	customDataId As Integer _
) As FabricationCustomDataType
Visual C++
public:
FabricationCustomDataType GetPartCustomDataType(
	int customDataId
)
Parameters
customDataId
Type: System.Int32
 The custom data identifier.
Return Value
 The custom data type.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentException |  The custom data does not exist.
See Also
FabricationConfiguration Class
Autodesk.Revit.DB Namespace